{
    "Global": {
        "nextPageButtonText": "Weiter",
        "nextPageButtonText-Portfolio": "Besuche mein Portfolio",
        "nextPageButtonText-CV": "Lese meinen Lebenslauf"
    },

    "Navbar": {
        "home": "Startseite",
        "portfolio": "Portfolio",
        "cv": "Lebenslauf",
        "settings": "Einstellungen"
    },

    "Footer": {
        "tagline": "Entwicklung nutzerfreundlicher Lösungen mit Forschung, Kreativität und Code.",
        "imprint": "Impressum"
    },

    "HomePage": {
        "hi-text": "Hallo, ich bin Marlon",
        "personal-description": "Ich bin ein Full-Stack-Webentwickler, der es liebt, nutzerorientierte Lösungen mit moderner Technologie zu entwickeln und dabei Forschungserkenntnisse mit Kreativität in XR und 3D-Kunst zu verbinden.",
        "Featured_Projects": "Ausgewählte Projekte",

        "Featured_Project1_title": "SECAI KI-Heizungs-App",
        "Featured_Project1_desc1": "Zusammenarbeit mit einem Team an einem vom BMWE geförderten Projekt zur Entwicklung einer intelligenten Heizungsdienstanwendung, die KI-Dienste nutzt, um die Energieeffizienz zu verbessern und Heizkosten zu senken.",
        "Featured_Project1_desc2": "Entwicklung eines Nest.js-Backends zur Verwaltung der Kommunikation mit mehreren Datenbanken, einer Client-Anwendung sowie zur Handhabung von Authentifizierung und Kontoverwaltung.",
        "Featured_Project1_desc3": "Konfiguration von Kubernetes auf einem virtuellen privaten Server, Containerisierung aller Anwendungen und Datenbanken mit Docker für effiziente Bereitstellung und Skalierung.",
        "Featured_Project1_desc4": "Einrichtung einer CI/CD-Pipeline mit GitLab zur Automatisierung der Bereitstellung und Verwaltung der Anwendung vom Repository bis zum VPS und zur Client-Auslieferung.",
        "Featured_Project1_desc5": "Integration mit Gerä connue von externen Partnern, die Steuerung und Kommunikation über den Backend-Server mit Azure IoT Hub ermöglicht.",

        "Featured_Project2_title": "VR-Lesetandem",
        "Featured_Project2_desc1": "Entwicklung einer VR-Anwendung, um Kindern beim Erlernen der deutschen Sprache zu helfen, nativ auf MetaQuest mit Hand-Tracking-Funktion, erstellt mit Unity und Blender.",
        "Featured_Project2_desc2": "Erstellung und Validierung des Designs durch einen Design-Science-Research-Ansatz.",
        "Featured_Project2_desc3": "Integration von KI-Diensten für Spracherkennung und Validierung von Lesefertigkeiten.",
        "Featured_Project2_desc4": "Integration von Google Cloud APIs für Übersetzungs- und Text-to-Speech-Dienste.",
        "Featured_Project2_desc5": "Durchführung mehrerer Tests mit Experten und der Zielgruppe, um die Anwendung zu verfeinern.",
        "Featured_Project2_desc6": "Veröffentlichung der Ergebnisse in einem Forschungspapier.",

        "curious": "Habe ich Ihre Neugier geweckt?"
    },

    "PortfolioPage": {
        "text1": "Während meines Studiums und meiner Berufserfahrung hatte ich die Möglichkeit, mit verschiedenen Technologien, Datenbanken und Tools zu arbeiten. Außerdem habe ich an einer Vielzahl von Projekten teilgenommen, sowohl in meiner Freizeit als auch im beruflichen Umfeld, was mir ermöglichte, meine technischen Fähigkeiten zu vertiefen und vielfältige praktische Erfahrungen zu sammeln.",
        "universities": "Universitäten",
        "work": "Arbeit",
        "technologies": "Technologien",
        "development": "Entwicklung",
        "databases": "Datenbanken",
        "os": "Betriebssysteme",
        "ProcessModeling": "Prozessmodellierung mit BPMN und eEPK, Durchführung von Workshops am Arbeitsplatz und an Universitäten zu diesen Themen",
        "other": "Andere Tools",
        "nginx": "Webhosting mit Nginx auf Linux-Servern",
        "blender": "3D-Modellierung, Texturierung, Rigging und Animation in Blender",
        "rpa": "Robotic Process Automation",
        "bpmn": "BPMN und eEPK Fähigkeiten",
        "vr": "VR und AR Projekte mit Unity und Unreal Engine",
        "ai": "KI Projekte mit Python und scikit-learn",
        "websockets": "Einsatz von Websockets für Echtzeitkommunikation in Webanwendungen",
        "projects": "Projekte",
        "project1-title": "VR Lesetandem",
        "project1-description": "Ein VR-Lesetrainer für Kinder. Die Kinder befinden sich in einer immersiven Umgebung im Wald des Märchens „Rotkäppchen“. Die Kinder müssen den Text lesen, um die Geschichte fortzusetzen. Die KI überprüft die korrekte Aussprache.",
        "project2-title": "Video Generator",
        "project2-description": "Ein Tool zur automatischen Erstellung von Videos mit Python und Google Gemini. Das Tool generiert automatisch eine Geschichte, Text in Sprache aus dieser Geschichte sowie Untertitel mit Timing aus dem Text in Sprache. Anschließend fügt es alles zu einem Video zusammen, das es nach dem Zufallsprinzip aus einer Reihe von Vorlagen auswählt, und lädt es hoch, ohne dass eine Benutzereingabe erforderlich ist.",
        "project3-title": "KI-Web-Dashboard",
        "project3-description": "Ein Web-Dashboard zur Visualisierung der Ergebnisse eines KI-Modells in Bezug auf einen intelligenten Kuhstall. Das Dashboard nutzt einen Websocket, um die Ergebnisse des KI-Modells in Echtzeit anzuzeigen. Darüber hinaus bietet es Live-Bilder sowie Echtzeitdaten wie Temperatur und Luftfeuchtigkeit.",
        "project4-title": "Circularity Navigator",
        "project4-description": "Eine Web-App, die Unternehmen dabei hilft, nachhaltiger zu werden. Die Website ermöglicht es Unternehmen, sich über das Thema Kreislaufwirtschaft und Design zu informieren und ermöglicht es ihnen, zentrale Designprinzipien für ihre Produkte auszuwählen und zu exportieren.",
        "project5-title": "BPMN Website und App",
        "project5-description": "Web-App, mit der Benutzer ein bpmn-Diagramm erstellen können. Das bpmn-Diagramm wird dann konvertiert und in einer Neo4j-Datenbank gespeichert. Die einzelnen Schritte können dann mit einer Flutter-App ausgeführt werden, die den Nutzer durch den Prozess führt.",
        "more": "und viele mehr"
    },

    "cv": {
        "cv": "Lebenslauf",
        "name": "Name:",
        "birthdate": "Geburtsdatum",
        "work": "Arbeit",
        "dfki": "seit 2022: Deutsches Forschungszentrum für künstliche Intelligenz",
        "uva": "Auslandssemester an der Universidad de Valladolid (Spanien)",
        "uos": "Universität Osnabrück (Master)",
        "dhbw": "Duale Hochschule Baden-Württemberg (Bachelor)",
        "studies": "Studium",
        "internships": "Praktika",
        "schools": "Schule",
        "retirement-home": "Altersheim"
    },

    "Imprint": {
        "title": "Impressum",
        "section1": "Angaben gemäß § 5 DDG",
        "name": "Marlon Werth",
        "addressLine1": "Wesereschstraße 39",
        "addressLine2": "49084 Osnabrück",
        "representedByTitle": "Vertreten durch:",
        "representedBy": "Marlon Werth",
        "contactTitle": "Kontakt:",
        "phone": "Telefon",
        "email": "E-Mail",
        "disclaimerTitle": "Haftungsausschluss:",
        "contentLiabilityTitle": "Haftung für Inhalte",
        "contentLiability": "Die Inhalte unserer Seiten wurden mit größter Sorgfalt erstellt. Für die Richtigkeit, Vollständigkeit und Aktualität der Inhalte können wir jedoch keine Gewähr übernehmen. Als Diensteanbieter sind wir gemäß § 7 Abs.1 DDG für eigene Inhalte auf diesen Seiten nach den allgemeinen Gesetzen verantwortlich. Nach §§ 8 bis 10 DDG sind wir als Diensteanbieter jedoch nicht verpflichtet, übermittelte oder gespeicherte fremde Informationen zu überwachen oder nach Umständen zu forschen, die auf eine rechtswidrige Tätigkeit hinweisen. Verpflichtungen zur Entfernung oder Sperrung der Nutzung von Informationen nach den allgemeinen Gesetzen bleiben hiervon unberührt. Eine diesbezügliche Haftung ist jedoch erst ab dem Zeitpunkt der Kenntnis einer konkreten Rechtsverletzung möglich. Bei Bekanntwerden von entsprechenden Rechtsverletzungen werden wir diese Inhalte umgehend entfernen.",
        "linkLiabilityTitle": "Haftung für Links",
        "linkLiability": "Unser Angebot enthält Links zu externen Webseiten Dritter, auf deren Inhalte wir keinen Einfluss haben. Deshalb können wir für diese fremden Inhalte auch keine Gewähr übernehmen. Für die Inhalte der verlinkten Seiten ist stets der jeweilige Anbieter oder Betreiber der Seiten verantwortlich. Die verlinkten Seiten wurden zum Zeitpunkt der Verlinkung auf mögliche Rechtsverstöße überprüft. Rechtswidrige Inhalte waren zum Zeitpunkt der Verlinkung nicht erkennbar. Eine permanente inhaltliche Kontrolle der verlinkten Seiten ist jedoch ohne konkrete Anhaltspunkte einer Rechtsverletzung nicht zumutbar. Bei Bekanntwerden von Rechtsverletzungen werden wir derartige Links umgehend entfernen.",
        "copyrightTitle": "Urheberrecht",
        "copyright": "Die durch die Seitenbetreiber erstellten Inhalte und Werke auf diesen Seiten unterliegen dem deutschen Urheberrecht. Die Vervielfältigung, Bearbeitung, Verbreitung und jede Art der Verwertung außerhalb der Grenzen des Urheberrechtes bedürfen der schriftlichen Zustimmung des jeweiligen Autors bzw. Erstellers. Downloads und Kopien dieser Seite sind nur für den privaten, nicht kommerziellen Gebrauch gestattet. Soweit die Inhalte auf dieser Seite nicht vom Betreiber erstellt wurden, werden die Urheberrechte Dritter beachtet. Insbesondere werden Inhalte Dritter als solche gekennzeichnet. Sollten Sie trotzdem auf eine Urheberrechtsverletzung aufmerksam werden, bitten wir um einen entsprechenden Hinweis. Bei Bekanntwerden von Rechtsverletzungen werden wir derartige Inhalte umgehend entfernen.",
        "privacyTitle": "Datenschutz",
        "privacy": "Die Nutzung unserer Webseite ist in der Regel ohne Angabe personenbezogener Daten möglich. Soweit auf unseren Seiten personenbezogene Daten (beispielsweise Name, Anschrift oder eMail-Adressen) erhoben werden, erfolgt dies, soweit möglich, stets auf freiwilliger Basis. Diese Daten werden ohne Ihre ausdrückliche Zustimmung nicht an Dritte weitergegeben. Wir weisen darauf hin, dass die Datenübertragung im Internet (z.B. bei der Kommunikation per E-Mail) Sicherheitslücken aufweisen kann. Ein lückenloser Schutz der Daten vor dem Zugriff durch Dritte ist nicht möglich. Der Nutzung von im Rahmen der Impressumspflicht veröffentlichten Kontaktdaten durch Dritte zur Übersendung von nicht ausdrücklich angeforderter Werbung und Informationsmaterialien wird hiermit ausdrücklich widersprochen. Die Betreiber der Seiten behalten sich ausdrücklich rechtliche Schritte im Falle der unverlangten Zusendung von Werbeinformationen, etwa durch Spam-Mails, vor.",
        "impressumGenerator": "Website Impressum von"
    }
}
