{
    "Global": {
        "nextPageButtonText": "Continue"
    },

    "Navbar": {
        "home": "Home",
        "portfolio": "Portfolio",
        "cv": "Curriculum Vitae",
        "settings": "Settings"
    },

    "HomePage": {
        "welcome": "Welcome!",
        "text1": "My name is Marlon, I am 25 years old and I have just completed writing my Master's thesis in Business Information Systems. I have a keen interest in IT technology, with a particular focus on web and app development as well as artificial intelligence. I have over 6 years of programming experience and nearly 3 years of professional experience as a full-stack-web developer.", 
        "text2": "I am an open, friendly person who is always eager to try out new technologies in order to continuously expand my skills. In addition to German, I have excellent English and Spanish skills.",
        "text3": "During my dual study programme, I was able to gain a lot of experience in developing IT technology, managing projects, writing scientific papers and working in teams. I was able to put my theoretical experience into practice by developing web tools, apps, automation measures and other programmes in several projects at my university or at my workplace. I also had the opportunity to familiarise myself with 3D technology through VR and AR projects.",
        "text4": "During my time at the German Research Center for Artificial Intelligence I have not only been able to deepen my programming skills, but also familiarise myself with the topic of artificial intelligence. I worked on various AI projects in order to implement AI into innovative web applications."
    },

    "PortfolioPage": {
        "text1": "During my studies and professional experience, I had the opportunity to work with various technologies, databases, and tools. I also participated in a wide range of projects, both in my free time and within professional settings, which allowed me to deepen my technical skills and gain diverse practical experience.",
        "universities": "Universities",
        "work": "Work",
        "technologies": "Technologies",
        "development": "Development",
        "databases": "Databases",
        "os": "Operating Systems",
        "other": "Other",
        "nginx": "Webhosting with Nginx on Linux-Servers",
        "blender": "3D modeling with Blender",
        "rpa": "Robotic Process Automation",
        "bpmn": "BPMN and eEPK skills",
        "vr": "VR and AR projects with Unity and Unreal Engine",
        "ai": "AI projects with Python and scikit-learn",
        "git": "Version control with Git (GitHub, GitLab)",
        "projects": "Projects",
        "project1-title": "VR reading tandem",
        "project1-description": "A reading trainer for children in VR. The children are placed into an immersive Environment in the from of the forrest from the farytale 'little red riding hood'. The children have to read the text to continue the story. Correct pronunciation is checked using AI.",
        "project2-title": "Video Generator",
        "project2-description": "A tool to generate videos automatically using python and Google Gemini. The tool automatically generates a story, text to speech from that story as well as captions with timing from the text to speech. It than merges everything together to a video which it chooses randomly from a number of templates and uploads it without needing any user input.",
        "project3-title": "AI-Web-Dashboard",
        "project3-description": "A web dashboard to visualize the results of an AI model in regards to a smart cowshed. The dashboard uses a websocket to display the results of the AI model in real time. In addition it provides live imaging aswell as real time data like temperature and humidity.",
        "project4-title": "Circularity Navigator",
        "project4-description": "A Web-App to help companies to become more sustainable. The website allows companies to educate themselfes about the topic of circular economy and design and allows them to select core design principles for their products and export them.",
        "project5-title": "BPMN Website and App",
        "project5-description": "Web-App which allows users to create a bpmn diagram. The bpmn diagram than gets converted and saved to a Neo4j database. The individual steps can than be executed using a Flutter-App, which guides users through the process.",
        "more": "and many more"
    },

    "cv": {
        "cv": "Curriculum Vitae",
        "name": "Name:",
        "birthdate": "Birthdate",
        "work": "Work",
        "dfki": "since 2022: German Research Center for Artificial Intelligence",
        "uva": "Semester abroad at Universidad de Valladolid (Spain)",
        "uos": "Universität Osnabrück (Master)",
        "dhbw": "Duale Hochschule Baden-Württemberg (Bachelor)",
        "studies": "Studies",
        "internships": "Internships",
        "schools": "Schools",
        "retirement-home": "Retirement home"

    }
}