{
    "Global": {
        "nextPageButtonText": "Continue",
        "nextPageButtonText-Portfolio": "Explore My Portfolio",
        "nextPageButtonText-CV": "Read My CV"
    },

    "Navbar": {
        "home": "Home",
        "portfolio": "Portfolio",
        "cv": "Curriculum Vitae",
        "settings": "Settings"
    },

    "Footer": {
        "tagline": "Building user-friendly solutions with research, creativity and code.",
        "imprint": "Imprint"
    },

    "HomePage": {
        "hi-text": "Hi, I'm Marlon",
        "personal-description": "I’m a full-stack web developer who loves building user-focused solutions with modern tech, blending research insights with creativity in XR and 3D art.",
        "Featured_Projects": "Featured Projects",

        "Featured_Project1_title": "SECAI Smart Heating App",
        "Featured_Project1_desc1": "Collaborated with a team on a BMWE-funded project to develop a smart heating service application, leveraging AI services to enhance energy efficiency and reduce heating costs.",
        "Featured_Project1_desc2": "Developed a Nest.js backend to manage communication with multiple databases, a client application, and handle authentication and account management.",
        "Featured_Project1_desc3": "Configured Kubernetes on a virtual private server, containerizing all applications and databases using Docker for efficient deployment and scaling.",
        "Featured_Project1_desc4": "Established a CI/CD pipeline with GitLab to automate deployment and management of the application from repository to VPS and client delivery.",
        "Featured_Project1_desc5": "Integrated with external partner devices, enabling control and communication through the backend server using Azure IoT Hub.",
        
        "Featured_Project2_title": "VR Reading Tandem",
        "Featured_Project2_desc1": "Developed a VR application to assist children in learning German, running natively on MetaQuest with hand-tracking functionality, built using Unity and Blender.",                
        "Featured_Project2_desc2": "Created and validated the design through a Design-Science-Research approach.",
        "Featured_Project2_desc3": "Integrated AI services for speech recognition and validation of reading abilities.",
        "Featured_Project2_desc4": "Integrated Google Cloud APIs for translation and text-to-speech services.",
        "Featured_Project2_desc5": "Conducted multiple tests with experts and the target audience to refine the application.",
        "Featured_Project2_desc6": "Published findings in a research paper.",
        
        "curious": "Have I sparked your curiosity?"
    },

    "PortfolioPage": {
        "text1": "During my studies and professional experience, I had the opportunity to work with various technologies, databases, and tools. I also participated in a wide range of projects, both in my free time and within professional settings, which allowed me to deepen my technical skills and gain diverse practical experience.",
        "universities": "Universities",
        "work": "Work",
        "technologies": "Technologies",
        "development": "Development",
        "databases": "Databases",
        "os": "Operating Systems",
        "other": "Other",
        "nginx": "Webhosting with Nginx on Linux-Servers",
        "blender": "3D modeling with Blender",
        "rpa": "Robotic Process Automation",
        "bpmn": "BPMN and eEPK skills",
        "vr": "VR and AR projects with Unity and Unreal Engine",
        "ai": "AI projects with Python and scikit-learn",
        "git": "Version control with Git (GitHub, GitLab)",
        "projects": "Projects",
        "project1-title": "VR reading tandem",
        "project1-description": "A reading trainer for children in VR. The children are placed into an immersive Environment in the from of the forrest from the farytale 'little red riding hood'. The children have to read the text to continue the story. Correct pronunciation is checked using AI.",
        "project2-title": "Video Generator",
        "project2-description": "A tool to generate videos automatically using python and Google Gemini. The tool automatically generates a story, text to speech from that story as well as captions with timing from the text to speech. It than merges everything together to a video which it chooses randomly from a number of templates and uploads it without needing any user input.",
        "project3-title": "AI-Web-Dashboard",
        "project3-description": "A web dashboard to visualize the results of an AI model in regards to a smart cowshed. The dashboard uses a websocket to display the results of the AI model in real time. In addition it provides live imaging aswell as real time data like temperature and humidity.",
        "project4-title": "Circularity Navigator",
        "project4-description": "A Web-App to help companies to become more sustainable. The website allows companies to educate themselfes about the topic of circular economy and design and allows them to select core design principles for their products and export them.",
        "project5-title": "BPMN Website and App",
        "project5-description": "Web-App which allows users to create a bpmn diagram. The bpmn diagram than gets converted and saved to a Neo4j database. The individual steps can than be executed using a Flutter-App, which guides users through the process.",
        "more": "and many more"
    },

    "cv": {
        "cv": "Curriculum Vitae",
        "name": "Name:",
        "birthdate": "Birthdate",
        "work": "Work",
        "dfki": "since 2022: German Research Center for Artificial Intelligence",
        "uva": "Semester abroad at Universidad de Valladolid (Spain)",
        "uos": "Universität Osnabrück (Master)",
        "dhbw": "Duale Hochschule Baden-Württemberg (Bachelor)",
        "studies": "Studies",
        "internships": "Internships",
        "schools": "Schools",
        "retirement-home": "Retirement home"
    },

    "Imprint": {
        "title": "Imprint",
        "section1": "Information according to § 5 DDG",
        "name": "Marlon Werth",
        "addressLine1": "Wesereschstraße 39",
        "addressLine2": "49084 Osnabrück",
        "representedByTitle": "Represented by:",
        "representedBy": "Marlon Werth",
        "contactTitle": "Contact:",
        "phone": "Phone",
        "email": "Email",
        "disclaimerTitle": "Disclaimer:",
        "contentLiabilityTitle": "Liability for Content",
        "contentLiability": "The contents of our pages were created with the utmost care. However, we cannot guarantee the accuracy, completeness, or timeliness of the content. As a service provider, we are responsible for our own content on these pages in accordance with § 7 Abs.1 DDG under general laws. According to §§ 8 to 10 DDG, we are not obligated as a service provider to monitor transmitted or stored third-party information or to investigate circumstances that indicate illegal activity. Obligations to remove or block the use of information under general laws remain unaffected. However, liability in this regard is only possible from the time of knowledge of a specific infringement. Upon becoming aware of such violations, we will remove this content immediately.",
        "linkLiabilityTitle": "Liability for Links",
        "linkLiability": "Our offer contains links to external third-party websites, the content of which we have no influence over. Therefore, we cannot assume any liability for this external content. The respective provider or operator of the pages is always responsible for the content of the linked pages. The linked pages were checked for possible legal violations at the time of linking. Illegal content was not recognizable at the time of linking. Permanent content control of the linked pages is, however, not reasonable without concrete evidence of a violation of the law. Upon becoming aware of legal violations, we will remove such links immediately.",
        "copyrightTitle": "Copyright",
        "copyright": "The content and works created by the site operators on these pages are subject to German copyright law. The duplication, processing, distribution, and any kind of exploitation outside the limits of copyright law require the written consent of the respective author or creator. Downloads and copies of this site are only permitted for private, non-commercial use. Insofar as the content on this site was not created by the operator, the copyrights of third parties are respected. In particular, third-party content is marked as such. Should you nevertheless become aware of a copyright infringement, we ask for a corresponding notice. Upon becoming aware of legal violations, we will remove such content immediately.",
        "privacyTitle": "Privacy",
        "privacy": "The use of our website is generally possible without providing personal data. Insofar as personal data (e.g., name, address, or email addresses) is collected on our pages, this is always done on a voluntary basis, as far as possible. This data will not be passed on to third parties without your express consent. We point out that data transmission on the Internet (e.g., when communicating by email) can have security gaps. A complete protection of the data against access by third parties is not possible. The use of contact data published within the framework of the imprint obligation by third parties for sending unsolicited advertising and information materials is hereby expressly prohibited. The operators of the pages expressly reserve the right to take legal action in the event of unsolicited sending of advertising information, such as spam emails.",
        "impressumGenerator": "Website Imprint by"
    }
}
