{
    "Global": {
        "nextPageButtonText": "Continuar",
        "nextPageButtonText-Portfolio": "Explora mi portafolio",
        "nextPageButtonText-CV": "Lee mi currículum"
    },

    "Navbar": {
        "home": "Inicio",
        "portfolio": "Portafolio",
        "cv": "Currículum Vítae",
        "settings": "Ajustes"
    },

    "HomePage": {
        "hi-text": "Hola, soy Marlon",
        "personal-description": "Soy un desarrollador web full-stack que ama crear soluciones centradas en el usuario con tecnología moderna, combinando conocimientos de investigación con creatividad en XR y arte 3D.",
        "Featured_Projects": "Proyectos Destacados",
        
        "Featured_Project1_title": "Backend de Aplicación de Calefacción AI",
        "Featured_Project1_desc1": "Desarrollé un backend en Nest.js para gestionar la comunicación con múltiples bases de datos, una aplicación cliente, y manejar la autenticación y la gestión de cuentas.",
        "Featured_Project1_desc2": "Configuré Kubernetes en un servidor privado virtual, contenedorizando todas las aplicaciones y bases de datos con Docker para un despliegue y escalado eficiente.",
        "Featured_Project1_desc3": "Establecí una pipeline CI/CD con GitLab para automatizar el despliegue y la gestión de la aplicación desde el repositorio hasta el VPS y la entrega al cliente.",
        "Featured_Project1_desc4": "Integré dispositivos de socios externos, permitiendo el control y la comunicación a través del servidor backend utilizando Azure IoT Hub.",
        
        "Featured_Project2_title": "Tándem de Lectura en VR",
        "Featured_Project2_desc1": "Desarrollé una aplicación de VR para ayudar a los niños a aprender alemán, funcionando de forma nativa en MetaQuest con funcionalidad de seguimiento de manos, creada con Unity y Blender.",
        "Featured_Project2_desc2": "Creé y validé el diseño mediante un enfoque de investigación en ciencia del diseño.",
        "Featured_Project2_desc3": "Integré servicios de IA para reconocimiento de voz y validación de habilidades de lectura.",
        "Featured_Project2_desc4": "Integré APIs de Google Cloud para servicios de traducción y texto a voz.",
        "Featured_Project2_desc5": "Realicé múltiples pruebas con expertos y la audiencia objetivo para perfeccionar la aplicación.",
        "Featured_Project2_desc6": "Publiqué los hallazgos en un artículo de investigación.",
        
        "tagline": "Construyendo soluciones amigables para el usuario con investigación, creatividad y código.",
        "curious": "¿He despertado tu curiosidad?"
    },

    "PortfolioPage": {
        "text1": "Durante mis estudios y mi experiencia profesional, tuve la oportunidad de trabajar con diversas tecnologías, bases de datos y herramientas. También participé en una amplia gama de proyectos, tanto en mi tiempo libre como en entornos profesionales, que me permitieron profundizar en mis conocimientos técnicos y adquirir experiencia práctica diversa.",
        "universities": "Universidaded",
        "work": "Trabajo",
        "technologies": "Tecnologías",
        "development": "Desarollo",
        "databases": "Base de datos",
        "os": "Sistema de operación",
        "other": "Otros",
        "nginx": "Webhosting con Nginx en un Linux servidor",
        "blender": "Modelado 3D con Blender",
        "rpa": "Robotic Process Automation",
        "bpmn": "Habilidades de BPMN y eEPK",
        "vr": "proyectos vr y ar con unity y unreal engine",
        "ai": "Proyectos IA con python y scikit-learn",
        "git": "Version control con Git (GitHub, GitLab)",
        "projects": "Proyectos",
        "project1-title": "Tándem de lectura VR",
        "project1-description": "Un entrenador de lectura para niños en RV. Los niños se sitúan en un entorno inmersivo en el bosque del cuento «Caperucita Roja». Los niños tienen que leer el texto para continuar la historia. La IA comprueba la pronunciación correcta.",
        "project2-title": "Generador de video",
        "project2-description": "Una herramienta para generar vídeos automáticamente usando python y Google Gemini. La herramienta genera automáticamente una historia, texto a voz a partir de esa historia, así como subtítulos con la sincronización del texto a voz. A continuación, lo fusiona todo en un vídeo que elige al azar entre una serie de plantillas y lo sube a la red sin necesidad de que lo introduzca el usuario.",
        "project3-title": "IA-Web-Dashboard",
        "project3-description": "Un panel web para visualizar los resultados de un modelo de IA en relación con un establo inteligente. El panel utiliza un websocket para mostrar los resultados del modelo de IA en tiempo real. Además, proporciona imágenes en directo y datos en tiempo real como la temperatura y la humedad.",
        "project4-title": "Circularity Navigator",
        "project4-description": "Una Web-App para ayudar a las empresas a ser más sostenibles. La web permite a las empresas informarse sobre el tema de la economía circular y el diseño, así como seleccionar los principios básicos de diseño para sus productos y exportarlos.",
        "project5-title": "BPMN Website y App",
        "project5-description": "Web-App que permite a los usuarios crear un diagrama bpmn. El diagrama bpmn se convierte y se guarda en una base de datos Neo4j. A continuación, los pasos individuales pueden ejecutarse mediante una aplicación Flutter, que guía a los usuarios a lo largo del proceso.",
        "more": "y mucho más"
    },

    "cv": {
        "cv": "Currículum Vítae",
        "name": "Nombre:",
        "birthdate": "fecha de nacimiento",
        "work": "Trabajo",
        "dfki": "desde 2022: Centro Alemán de Investigación en Inteligencia Artificial",
        "uva": "Semestre en el extranjero a Universidad de Valladolid (España)",
        "uos": "Universität Osnabrück (Master)",
        "dhbw": "Duale Hochschule Baden-Württemberg (Grado)",
        "studies": "Estudios",
        "internships": "Prácticas",
        "schools": "Escuela",
        "retirement-home": "Residencia de ancianos"
    }
}
