{
    "Global": {
        "nextPageButtonText": "Continuar",
        "nextPageButtonText-Portfolio": "Explora mi portafolio",
        "nextPageButtonText-CV": "Lee mi currículum"
    },

    "Navbar": {
        "home": "Inicio",
        "portfolio": "Portafolio",
        "cv": "Currículum Vítae",
        "settings": "Ajustes"
    },

    "Footer": {
        "tagline": "Construyendo soluciones amigables para el usuario con investigación, creatividad y código.",
        "imprint": "Impronta"
    },

    "HomePage": {
        "hi-text": "Hola, soy Marlon",
        "personal-description": "Soy un desarrollador web full-stack que ama crear soluciones centradas en el usuario con tecnología moderna, combinando conocimientos de investigación con creatividad en XR y arte 3D.",
        "Featured_Projects": "Proyectos Destacados",

        "Featured_Project1_title": "SECAI Aplicación de Calefacción AI",
        "Featured_Project1_desc1": "Colaboré con un equipo en un proyecto financiado por BMWE para desarrollar una aplicación de servicio de calefacción inteligente, aprovechando servicios de IA para mejorar la eficiencia energética y reducir costos de calefacción.",
        "Featured_Project1_desc2": "Desarrollé un backend en Nest.js para gestionar la comunicación con múltiples bases de datos, una aplicación cliente, y manejar la autenticación y la gestión de cuentas.",
        "Featured_Project1_desc3": "Configuré Kubernetes en un servidor privado virtual, contenedorizando todas las aplicaciones y bases de datos con Docker para un despliegue y escalado eficiente.",
        "Featured_Project1_desc4": "Establecí una pipeline CI/CD con GitLab para automatizar el despliegue y la gestión de la aplicación desde el repositorio hasta el VPS y la entrega al cliente.",
        "Featured_Project1_desc5": "Integré dispositivos de socios externos, permitiendo el control y la comunicación a través del servidor backend utilizando Azure IoT Hub.",

        "Featured_Project2_title": "Tándem de Lectura en VR",
        "Featured_Project2_desc1": "Desarrollé una aplicación de VR para ayudar a los niños a aprender alemán, funcionando de forma nativa en MetaQuest con funcionalidad de seguimiento de manos, creada con Unity y Blender.",
        "Featured_Project2_desc2": "Creé y validé el diseño mediante un enfoque de investigación en ciencia del diseño.",
        "Featured_Project2_desc3": "Integré servicios de IA para reconocimiento de voz y validación de habilidades de lectura.",
        "Featured_Project2_desc4": "Integré APIs de Google Cloud para servicios de traducción y texto a voz.",
        "Featured_Project2_desc5": "Realicé múltiples pruebas con expertos y la audiencia objetivo para perfeccionar la aplicación.",
        "Featured_Project2_desc6": "Publiqué los hallazgos en un artículo de investigación.",

        "curious": "¿He despertado tu curiosidad?"
    },

    "PortfolioPage": {
        "text1": "Durante mis estudios y mi experiencia profesional, tuve la oportunidad de trabajar con diversas tecnologías, bases de datos y herramientas. También participé en una amplia gama de proyectos, tanto en mi tiempo libre como en entornos profesionales, que me permitieron profundizar en mis conocimientos técnicos y adquirir experiencia práctica diversa.",
        "universities": "Universidaded",
        "work": "Trabajo",
        "technologies": "Tecnologías",
        "development": "Desarollo",
        "databases": "Base de datos",
        "os": "Sistema de operación",
        "ProcessModeling": "Modelado de procesos con BPMN y eEPK, Realicé talleres en el lugar de trabajo y en universidades sobre estos temas",
        "other": "Otros Herramientas",
        "nginx": "Webhosting con Nginx en un Linux servidor",
        "blender": "Modelado 3D, texturización, rigging y animación en Blender",
        "rpa": "Robotic Process Automation",
        "bpmn": "Habilidades de BPMN y eEPK",
        "vr": "proyectos vr y ar con unity y unreal engine",
        "ai": "Proyectos IA con python y scikit-learn",
        "websockets": "Utilizando websockets para comunicación en tiempo real en aplicaciones web",
        "projects": "Proyectos",
        "project1-title": "Tándem de lectura VR",
        "project1-description": "Un entrenador de lectura para niños en RV. Los niños se sitúan en un entorno inmersivo en el bosque del cuento «Caperucita Roja». Los niños tienen que leer el texto para continuar la historia. La IA comprueba la pronunciación correcta.",
        "project2-title": "Generador de video",
        "project2-description": "Una herramienta para generar vídeos automáticamente usando python y Google Gemini. La herramienta genera automáticamente una historia, texto a voz a partir de esa historia, así como subtítulos con la sincronización del texto a voz. A continuación, lo fusiona todo en un vídeo que elige al azar entre una serie de plantillas y lo sube a la red sin necesidad de que lo introduzca el usuario.",
        "project3-title": "IA-Web-Dashboard",
        "project3-description": "Un panel web para visualizar los resultados de un modelo de IA en relación con un establo inteligente. El panel utiliza un websocket para mostrar los resultados del modelo de IA en tiempo real. Además, proporciona imágenes en directo y datos en tiempo real como la temperatura y la humedad.",
        "project4-title": "Circularity Navigator",
        "project4-description": "Una Web-App para ayudar a las empresas a ser más sostenibles. La web permite a las empresas informarse sobre el tema de la economía circular y el diseño, así como seleccionar los principios básicos de diseño para sus productos y exportarlos.",
        "project5-title": "BPMN Website y App",
        "project5-description": "Web-App que permite a los usuarios crear un diagrama bpmn. El diagrama bpmn se convierte y se guarda en una base de datos Neo4j. A continuación, los pasos individuales pueden ejecutarse mediante una aplicación Flutter, que guía a los usuarios a lo largo del proceso.",
        "more": "y mucho más"
    },

    "cv": {
        "cv": "Currículum Vítae",
        "name": "Nombre:",
        "birthdate": "fecha de nacimiento",
        "work": "Trabajo",
        "dfki": "desde 2022: Centro Alemán de Investigación en Inteligencia Artificial",
        "uva": "Semestre en el extranjero a Universidad de Valladolid (España)",
        "uos": "Universität Osnabrück (Master)",
        "dhbw": "Duale Hochschule Baden-Württemberg (Grado)",
        "studies": "Estudios",
        "internships": "Prácticas",
        "schools": "Escuela",
        "retirement-home": "Residencia de ancianos"
    },

    "Imprint": {
        "title": "Impronta",
        "section1": "Información según § 5 DDG",
        "name": "Marlon Werth",
        "addressLine1": "Wesereschstraße 39",
        "addressLine2": "49084 Osnabrück",
        "representedByTitle": "Representado por:",
        "representedBy": "Marlon Werth",
        "contactTitle": "Contacto:",
        "phone": "Teléfono",
        "email": "Correo electrónico",
        "disclaimerTitle": "Descargo de responsabilidad:",
        "contentLiabilityTitle": "Responsabilidad por el contenido",
        "contentLiability": "Los contenidos de nuestras páginas fueron creados con el mayor cuidado. Sin embargo, no podemos garantizar la exactitud, integridad o actualidad de los contenidos. Como proveedor de servicios, somos responsables de nuestro propio contenido en estas páginas de acuerdo con el § 7 Abs.1 DDG bajo las leyes generales. Según §§ 8 a 10 DDG, no estamos obligados como proveedor de servicios a supervisar la información transmitida o almacenada de terceros ni a investigar circunstancias que indiquen actividad ilegal. Las obligaciones de eliminar o bloquear el uso de información bajo las leyes generales permanecen sin cambios. Sin embargo, la responsabilidad en este sentido solo es posible a partir del momento en que se tenga conocimiento de una infracción específica. Al tener conocimiento de tales violaciones, eliminaremos este contenido de inmediato.",
        "linkLiabilityTitle": "Responsabilidad por enlaces",
        "linkLiability": "Nuestra oferta contiene enlaces a sitios web externos de terceros, cuyo contenido no tenemos influencia. Por lo tanto, no podemos asumir ninguna responsabilidad por este contenido externo. El proveedor u operador respectivo de las páginas siempre es responsable del contenido de las páginas enlazadas. Las páginas enlazadas fueron verificadas en busca de posibles violaciones legales en el momento de la vinculación. Los contenidos ilegales no eran reconocibles en el momento de la vinculación. Sin embargo, un control permanente del contenido de las páginas enlazadas no es razonable sin evidencia concreta de una violación de la ley. Al tener conocimiento de violaciones legales, eliminaremos dichos enlaces de inmediato.",
        "copyrightTitle": "Derechos de autor",
        "copyright": "El contenido y las obras creadas por los operadores del sitio en estas páginas están sujetos a la ley de derechos de autor alemana. La duplicación, procesamiento, distribución y cualquier tipo de explotación fuera de los límites de la ley de derechos de autor requieren el consentimiento por escrito del respectivo autor o creador. Las descargas y copias de este sitio solo están permitidas para uso privado y no comercial. En la medida en que el contenido de este sitio no fue creado por el operador, se respetan los derechos de autor de terceros. En particular, el contenido de terceros está marcado como tal. Si, no obstante, se da cuenta de una infracción de derechos de autor, le pedimos un aviso correspondiente. Al tener conocimiento de violaciones legales, eliminaremos dicho contenido de inmediato.",
        "privacyTitle": "Privacidad",
        "privacy": "El uso de nuestro sitio web generalmente es posible sin proporcionar datos personales. En la medida en que se recopilen datos personales (por ejemplo, nombre, dirección o direcciones de correo electrónico) en nuestras páginas, esto siempre se hace de forma voluntaria, en la medida de lo posible. Estos datos no se transmitirán a terceros sin su consentimiento expreso. Señalamos que la transmisión de datos en Internet (por ejemplo, al comunicarse por correo electrónico) puede tener brechas de seguridad. No es posible una protección completa de los datos contra el acceso de terceros. El uso de los datos de contacto publicados en el marco de la obligación de impronta por parte de terceros para enviar publicidad no solicitada y materiales de información está expresamente prohibido. Los operadores de las páginas se reservan expresamente el derecho de emprender acciones legales en caso de envío no solicitado de información publicitaria, como correos electrónicos no deseados.",
        "impressumGenerator": "Impronta del sitio web por"
    }
}
